package utils

import (
	"crypto/rand"
	"encoding/json"
	"errors"
	"fmt"
	"html"
	"log"
	"math/big"
	"runtime"
	"sort"
	"strconv"
	"strings"
	"time"
	"unicode/utf16"

	"gopkg.in/tucnak/telebot.v3"
	"gorm.io/gorm/clause"
)

func UserFullName(user *telebot.User) string {
	fullname := user.FirstName
	if user.LastName != "" {
		fullname = fmt.Sprintf("%v %v", user.FirstName, user.LastName)
	}
	return fullname
}

func UserName(user *telebot.User) string {
	username := user.Username
	if user.Username == "" {
		username = UserFullName(user)
	}
	return username
}

func MentionUser(user *telebot.User) string {
	return fmt.Sprintf("<a href=\"tg://user?id=%v\">%v</a>", user.ID, UserFullName(user))
}

func RandInt(min int, max int) int {
	b, err := rand.Int(rand.Reader, big.NewInt(int64(max)))
	if err != nil {
		return 0
	}
	return min + int(b.Int64())
}

func StringInSlice(a string, list []string) bool {
	for _, b := range list {
		if b == a {
			return true
		}
	}
	return false
}

func IsAdmin(userid int64) bool {
	for _, b := range Config.Admins {
		if b == userid {
			return true
		}
	}
	return false
}

func IsAdminOrModer(userid int64) bool {
	for _, b := range Config.Admins {
		if b == userid {
			return true
		}
	}
	for _, b := range Config.Moders {
		if b == userid {
			return true
		}
	}
	return false
}

func RestrictionTimeMessage(seconds int64) string {
	var message = ""
	if seconds-30 > time.Now().Unix() {
		message = fmt.Sprintf(" до %v", time.Unix(seconds, 0).Format("02.01.2006 15:04:05"))
	}
	return message
}

func ErrorReporting(err error, context telebot.Context) {
	_, fn, line, _ := runtime.Caller(1)
	log.Printf("[%s:%d] %v", fn, line, err)
	text := fmt.Sprintf("<pre>[%s:%d]\n%v</pre>", fn, line, err)
	if context.Message() != nil {
		MarshalledMessage, _ := json.MarshalIndent(context.Message(), "", "    ")
		JsonMessage := html.EscapeString(string(MarshalledMessage))
		text += fmt.Sprintf("\n\nMessage:\n<pre>%v</pre>", JsonMessage)
	}
	Bot.Send(telebot.ChatID(Config.SysAdmin), text)
}

func FindUserInMessage(context telebot.Context) (telebot.User, int64, error) {
	var user telebot.User
	var err error = nil
	var untildate = time.Now().Unix() + 86400
	for _, entity := range context.Message().Entities {
		if entity.Type == telebot.EntityTMention {
			user = *entity.User
			if len(context.Args()) == 2 {
				addtime, err := strconv.ParseInt(context.Args()[1], 10, 64)
				if err != nil {
					return user, untildate, err
				}
				untildate += addtime - 86400
			}
			return user, untildate, err
		}
	}
	if context.Message().ReplyTo != nil {
		user = *context.Message().ReplyTo.Sender
		if len(context.Args()) == 1 {
			addtime, err := strconv.ParseInt(context.Args()[0], 10, 64)
			if err != nil {
				return user, untildate, errors.New("время указано неверно")
			}
			untildate += addtime - 86400
		}
	} else {
		if len(context.Args()) == 0 {
			err = errors.New("пользователь не найден")
			return user, untildate, err
		}
		if user.ID == 0 {
			user, err = GetUserFromDB(context.Args()[0])
			if err != nil {
				return user, untildate, err
			}
		}
		if len(context.Args()) == 2 {
			addtime, err := strconv.ParseInt(context.Args()[1], 10, 64)
			if err != nil {
				return user, untildate, errors.New("время указано неверно")
			}
			untildate += addtime - 86400
		}
	}
	return user, untildate, err
}

func GatherData(update *telebot.Update) error {
	if update.Message == nil || update.Message.Sender == nil {
		return nil
	}
	//User update
	UserResult := DB.Clauses(clause.OnConflict{
		UpdateAll: true,
	}).Create(update.Message.Sender)
	if UserResult.Error != nil {
		return UserResult.Error
	}
	if update.Message.Sender.IsBot || update.Message.Chat.ID != Config.Chat {
		return nil
	}
	//Message insert
	var Message Message
	Message.ID = update.Message.ID
	Message.UserID = update.Message.Sender.ID
	Message.Date = time.Unix(update.Message.Unixtime, 0)
	Message.ChatID = update.Message.Chat.ID
	if update.Message.ReplyTo != nil {
		Message.ReplyTo = update.Message.ReplyTo.ID
	}
	Message.Text = update.Message.Text
	switch {
	case update.Message.Animation != nil:
		Message.FileType = "Animation"
		Message.FileID = update.Message.Animation.FileID
		Message.Text = update.Message.Caption
	case update.Message.Audio != nil:
		Message.FileType = "Audio"
		Message.FileID = update.Message.Audio.FileID
		Message.Text = update.Message.Caption
	case update.Message.Photo != nil:
		Message.FileType = "Photo"
		Message.FileID = update.Message.Photo.FileID
		Message.Text = update.Message.Caption
	case update.Message.Video != nil:
		Message.FileType = "Video"
		Message.FileID = update.Message.Video.FileID
		Message.Text = update.Message.Caption
	case update.Message.Voice != nil:
		Message.FileType = "Voice"
		Message.FileID = update.Message.Voice.FileID
		Message.Text = update.Message.Caption
	case update.Message.Document != nil:
		Message.FileType = "Document"
		Message.FileID = update.Message.Document.FileID
		Message.Text = update.Message.Caption
	}
	MessageResult := DB.Create(&Message)
	if MessageResult.Error != nil {
		return MessageResult.Error
	}
	//Words insert
	var Word Word
	Word.ChatID = Message.ChatID
	Word.UserID = Message.UserID
	Word.Date = Message.Date
	Message.Text = strings.ReplaceAll(Message.Text, ",", "")
	Message.Text = strings.ReplaceAll(Message.Text, ".", "")
	Message.Text = strings.ReplaceAll(Message.Text, "!", "")
	Message.Text = strings.ReplaceAll(Message.Text, "?", "")
	exclude := []string{"и", "в", "не", "на", "я", "быть", "с", "он", "что", "а", "это", "этот", "по", "к", "но", "они", "мы", "она", "как", "то", "который", "из", "у", "свой", "вы", "весь", "за", "для", "от", "мочь", "так", "ты", "о", "что", "же", "всё", "такой", "тот", "или", "если", "только", "его", "один", "бы", "себя", "ещё", "другой", "уже", "когда", "сказать", "до", "мой", "наш", "чтобы", "становиться", "говорить", "самый", "знать", "вот", "очень", "кто", "при", "можно", "первый", "сам", "два", "новый", "даже", "хотеть", "должен", "их", "какой", "иметь", "со", "там", "после", "понимать", "ли", "где", "её", "под", "давать", "нет", "каждый", "без", "ну", "более", "идти", "большой", "просто", "начинать", "чем", "сделать", "ваш", "надо", "здесь", "делать", "видеть", "потом", "да", "ничто", "получать", "сейчас", "через", "много", "теперь", "оставаться", "думать", "ни", "хороший", "тогда", "тут", "несколько", "тоже", "приходить", "работать", "отвечать", "последний", "жить", "выходить", "также", "всегда", "являться", "находить", "между", "оказываться", "хотя", "смотреть", "конечно", "принимать", "спрашивать", "проходить", "три", "второй", "перед", "лишь", "именно", "поэтому", "почему", "любой", "однако", "никто", "решать", "считать", "над", "сегодня", "русский", "вообще", "взять", "хорошо", "пойти", "некоторый", "многие", "приходиться", "любить", "нужно", "всё", "больше", "высокий", "например", "почти", "писать", "возвращаться", "сидеть", "уходить", "твой", "пока", "находиться", "увидеть", "что-то", "ведь", "стоять", "никогда", "помогать", "стоить", "появляться", "совсем", "показывать", "казаться", "далеко", "нужный", "маленький", "российский", "рассказывать", "сразу", "полный", "никакой", "главный", "оно", "часто", "создавать", "написать", "вместе", "старый", "следующий", "подобный", "разный", "про", "общий", "кроме", "смочь", "всякий", "следовать", "использовать", "собственный", "замечать", "молодой", "предлагать", "снова", "важный", "ждать", "вдруг", "читать", "скоро", "входить", "пытаться", "основной", "посмотреть", "открывать", "узнавать", "настоящий", "существовать", "назад", "совершенно", "простой", "оставлять", "действительно", "затем", "вести", "играть", "государственный", "происходить", "помнить", "называть", "нельзя", "начинаться", "данный", "подходить", "опять", "равный", "хотеться", "вызывать", "иной", "белый", "наконец", "куда", "известный", "забывать", "особенно", "против", "советский", "лучший", "заниматься", "огромный", "среди", "великий", "слишком", "иногда", "лежать", "вспоминать", "пять", "бывать", "получаться", "достаточно", "сильный", "быстро", "чувствовать", "третий", "чёрный", "готовый", "продолжать", "поскольку", "политический", "представлять", "попадать", "слышать", "подумать", "ходить", "рядом", "оба", "современный", "удаваться", "приезжать", "плохой", "из-за", "около", "просить", "интересный", "необходимый", "вполне", "объяснять", "рано", "обращаться", "поставить", "связывать", "точно", "четыре", "долго", "различный", "либо", "социальный", "менее", "искать", "правда", "красный", "давно", "легко", "бояться", "возможно", "занимать", "военный", "целый", "умирать", "обычно", "спать", "сообщать", "носить", "брать", "снимать", "относиться", "выбирать", "определять", "живой", "вставать", "случаться", "небольшой", "купить", "сей", "единственный", "правый", "немного", "сколько", "зачем", "приносить", "наверное", "убивать", "кстати", "внутренний", "позволять", "далее", "успевать", "возможный", "слушать", "поднимать", "бросать", "чуть", "собираться", "требовать", "отмечать", "верить", "близкий", "человеческий", "довольно", "экономический", "строить", "местный", "определённый", "особый", "добрый", "остальной", "подниматься", "общественный", "заставлять", "туда", "пусть", "мало", "сначала", "отдавать", "останавливаться", "ехать", "встречать", "нравиться", "какой-то", "всё-таки", "десять", "обычный", "держать", "похожий", "устанавливать", "дорогой", "реальный", "наиболее", "крупный", "как-то", "хоть", "улыбаться", "весьма", "больший", "домой", "личный", "касаться", "причём", "необходимо", "проводить", "отдельный", "добавлять", "стараться", "указывать", "пить", "средний", "собирать", "серьёзный", "передавать", "национальный", "американский", "словно", "впрочем", "свободный", "переходить", "международный", "действовать", "способный", "практически", "отказываться", "поздний", "лучше", "соглашаться", "кто-то", "надеяться", "обнаруживать", "обеспечивать", "составлять", "московский", "заявлять", "нормальный", "полностью", "сильно", "обращать", "состоять", "вместо", "закрывать", "поступать", "пробовать", "красивый", "научный", "мировой", "детский", "уметь", "желать", "широкий", "прекрасный", "ибо", "постоянно", "рабочий", "внешний", "тяжёлый", "услышать", "сложный", "несмотря", "короткий", "странный", "низкий", "сюда", "прошлый", "пользоваться", "быстрый", "всего", "выглядеть", "иметься", "возникать", "английский", "высший", "разве", "вокруг", "длинный", "бывший", "учиться", "чистый", "потерять", "трудно", "продавать", "служить", "направлять", "двадцать", "столь", "откуда", "гораздо", "страшный", "ожидать", "вновь", "летать", "сесть", "специальный", "однажды", "устраивать", "посылать", "иначе", "крайний", "признавать", "достигать", "исчезать", "означать", "глядеть", "показываться", "изменять", "отправлять", "ставить", "пожалуйста", "поехать", "единый", "совершать", "называться", "прямой", "долгий", "отправляться", "конкретный", "будто", "бежать", "открытый", "положить", "зависеть", "немецкий", "обязательно", "примерно", "плохо", "видно", "некий", "прежде", "произносить", "переставать", "дома", "западный", "любимый", "проверять", "спасибо", "вперёд", "вовсе", "уверенный", "никак", "описывать", "чужой", "завтра", "задавать", "сохранять", "заканчивать", "вчера", "прощать", "прямо", "расти", "звать", "правильный", "шесть", "одновременно", "может", "физический", "знакомый", "медленный", "боевой", "хватать", "естественно", "постоянный", "женский", "встречаться", "очередной", "счастливый", "видимо", "кажется", "насколько", "исторический", "лёгкий", "соответствующий", "приглашать", "городской", "впервые", "недавно", "есть", "значить", "благодаря", "обладать", "многое", "правильно", "считаться", "глубокий", "принадлежать", "наступать", "приобретать", "абсолютно", "спокойно", "доходить", "приводить", "французский", "старший", "подавать", "доставать", "оценивать", "где-то", "малый", "частный", "финансовый", "кричать", "наблюдать", "отличаться", "платить", "выпивать", "располагать", "золотой", "тёмный", "ради", "допускать", "судить", "объявлять", "изменяться", "дополнительный", "пустой", "холодный", "зато", "центральный", "профессиональный", "федеральный", "технический", "превращаться", "левый", "добиваться", "выступать", "родной", "стремиться", "вроде", "настолько", "поддерживать", "упасть", "значительный", "напоминать", "народный", "вниз", "учёный", "складываться", "утверждать", "позвонить", "выпускать", "вскоре", "ближайший", "доказывать", "выражать", "информационный", "двигаться", "сто", "чего", "европейский", "едва", "зелёный", "петь", "будущий", "вводить", "семь", "столько", "заканчиваться", "ясный", "понравиться", "предоставлять", "придумывать", "тихо", "что-нибудь", "родиться", "северный", "полезный", "лично", "выдавать", "подробный", "слабый", "наоборот", "итак", "выполнять", "нынешний", "гражданский", "использоваться", "участвовать", "рассматривать", "древний", "бить", "невозможный", "естественный", "иностранный", "ладно", "массовый", "звонить", "организовывать", "ясно", "молчать", "приятный", "прочитать", "понятный", "прочий", "падать", "записывать", "обещать", "покупать", "открываться", "посвящать", "разумеется", "тонкий", "смеяться", "яркий", "соответствовать", "дальнейший", "разбираться", "верный", "мелкий", "проживать", "согласный", "мешать", "постепенно", "двое", "нечто", "обратно", "здоровый", "приниматься", "вероятный", "умный", "вступать", "сквозь", "подтверждать", "святой", "вверх", "удивляться", "уехать", "знакомиться", "покидать", "прежний", "официальный", "состояться", "трудный", "испытывать", "полагать", "домашний", "сегодняшний", "собственно", "опасный", "согласно", "богатый", "морской", "учить", "возвращать", "вырастать", "содержать", "отсюда", "просыпаться", "назначать", "привлекать", "привыкать", "здравствовать", "разрабатывать", "поздно", "активный", "звучать", "выделять", "электронный", "резко", "разговаривать", "редко", "поговорить", "разрешать", "замечательный", "требоваться", "плакать", "заходить", "кивать", "милый", "зарабатывать", "предполагать", "традиционный", "уничтожать", "решаться", "торговый", "горячий", "поворачиваться", "ночной", "тридцать", "возле", "суметь", "опубликовать", "глубоко", "сдавать", "точный", "прибывать", "присылать", "останавливать", "говориться", "садиться", "восточный", "знаменитый", "тёплый", "включать", "бросаться", "заключаться", "тихий", "выводить", "чей", "восемь", "взглядывать", "присутствовать", "неожиданно", "кончаться", "медицинский", "захотеть", "культурный", "прекрасно", "предыдущий", "ранний", "ездить", "пожалуй", "терять", "бедный", "внутри", "рад", "менять", "запрещать", "почему-то", "литературный", "научиться", "протягивать", "задумываться", "вносить", "понятно", "творческий", "материальный", "учебный", "признаваться", "похоже", "железный", "серый", "спустя", "держаться", "заранее", "дарить", "спускаться", "спасти", "тяжело", "мощный", "производить", "эффективный", "набирать", "нижний", "скажем", "южный", "пропадать", "вздыхать", "следить", "сорок", "захватывать", "продолжаться", "истинный", "неужели", "мягкий", "художественный", "готовить", "избегать", "посещать", "четвёртый", "забирать", "вечный", "пускать", "ах", "случайно", "мужской", "бороться", "гореть", "лишний", "связанный", "свежий", "отечественный", "выдерживать", "повторять", "разделять", "соединять", "уважаемый", "заключать", "увеличивать", "должно", "немедленно", "семейный", "обходиться", "честно", "исходить", "приказывать", "светлый", "слегка", "убеждать", "мимо", "уставать", "добираться", "основываться", "отпускать", "подчёркивать", "спокойный", "упоминать", "весёлый", "побеждать", "удобный", "таков", "меняться", "подготавливать", "ранее", "развиваться", "сохраняться", "извинять", "нечего", "готовиться", "доставлять", "мол", "буквальный", "учитывать", "вне", "религиозный", "впереди", "осознавать", "верхний", "выносить", "справляться", "рожать", "предусматривать", "привозить", "внимательный", "изучать", "подписывать", "многочисленный", "громко", "нарушать", "жизненный", "узкий", "ценный", "страдать", "острый", "оттуда", "далёкий", "направляться", "сравнивать", "удивительный", "отходить", "мёртвый", "заменять", "странно", "мечтать", "раньше", "убирать", "внезапный", "крайне", "догадываться", "обсуждать", "надевать", "специально", "компьютерный", "проводиться", "предупреждать", "раздаваться", "синий", "обратный", "выигрывать", "больной", "опускать", "дальний", "чисто", "заглядывать", "интересовать", "божий", "договариваться", "характерный", "общаться", "важно", "ужасный", "висеть", "толстый", "отличный", "когда-то", "вдоль", "соседний", "жёсткий", "выяснять", "спешить", "пятый", "конечный", "круглый", "делаться", "дикий", "по-прежнему", "наносить", "каков", "плавать", "младший", "поражать", "убеждаться", "совместный", "лишать", "региональный", "объединять", "крепкий", "способствовать", "сходить", "покрывать", "генеральный", "достойный", "китайский", "высказывать", "голубой", "везде", "перевести", "нуждаться", "переносить", "сексуальный", "включая", "музыкальный", "помимо", "виноватый", "индивидуальный", "положительный", "видный", "следовательно", "психологический", "полтора", "болеть", "глупый", "задний", "доступный", "осторожно", "независимый", "давай", "насчёт", "солнечный", "фактически", "уверять", "поворачивать", "честный", "оборачиваться", "классический", "сомневаться", "пропускать", "православный", "распространять", "вытаскивать", "исключать", "ударять", "практический", "возражать", "воспользоваться", "предстоять", "злой", "представляться", "прекращать", "юридический", "редкий", "неизвестный", "жаль", "широко", "заслуживать", "сухой", "существенный", "стрелять", "особо", "молча", "отражать", "несчастный", "денежный", "безусловно", "довольный", "популярный", "последующий", "разрушать", "лечь", "раскрывать", "рассчитывать", "очевидный", "пятьдесят", "управлять", "земной", "жёлтый", "сложно", "судебный", "деревянный", "школьный", "из-под", "оказывать", "навсегда", "космический", "повезти", "выясняться", "засыпать", "заплатить", "половой", "прятать", "реализовывать", "освобождать", "сверху", "трое", "грязный", "деловой", "телефонный", "дожидаться", "превращать", "коммерческий", "проявляться", "удивлять", "обязательный", "найтись", "поймать", "наверняка", "подождать", "японский", "сельский", "напротив", "защищать", "предпочитать", "заказывать", "воспринимать", "резкий", "одинаковый", "свидетельствовать", "верно", "курить", "взяться", "строгий", "исключительно", "дышать", "противоположный", "ядерный", "окончательно", "гулять", "окружающий", "попадаться", "уникальный", "разбивать", "девять", "издавать", "рекламный", "воздушный", "серьёзно", "заводить", "ощущать", "тянуть", "уголовный", "приятно", "каменный", "одевать", "еврейский", "восклицать", "успешный", "немало", "природный", "взрослый", "таковой", "ведущий", "какой-нибудь", "разумный", "владеть", "спорить", "охватывать", "применять", "случайный", "восстанавливать", "определяться", "вслед", "осуществлять", "относить", "активно", "успешно", "удерживать", "запоминать", "текущий", "повышать", "неприятный", "строго", "влиять", "бегать", "спортивный", "программный", "правовой", "вынуждать", "налоговый", "скрывать", "отсутствовать", "пьяный", "вкладывать", "кончать", "больно", "заполнять", "твёрдый", "вон", "терпеть", "пятнадцать", "намного", "летний", "радоваться", "интеллектуальный", "складывать", "смешной", "абсолютный", "угодно", "рекомендовать", "опускаться", "бесконечный", "нажимать", "подбирать", "юный", "ненавидеть", "ой", "удовлетворять", "преодолевать", "неожиданный", "выражаться", "отлично", "отводить", "длительный", "планировать", "предпринимать", "подсказывать", "голый", "доводить", "мирный", "переживать", "стратегический", "моральный", "чрезвычайно", "приближаться", "ныне", "мобильный", "образовывать", "осуществляться", "заговаривать", "трудовой", "непонятный", "шептать", "наверно", "куда-то", "областной", "достаточный", "обманывать", "увы", "успокаиваться", "рыночный", "кормить", "контролировать", "сбивать", "проникать", "поздравлять", "выставлять", "пожимать", "жениться", "зря", "излагать", "тщательно", "регистрировать", "оглядываться", "привычный", "выезжать", "необычный", "обходить", "прочесть", "предназначенный", "демократический", "задерживать", "идеальный", "чёткий", "бесплатный", "обнимать", "никуда", "уступать", "завершать", "убегать", "научить", "нежный", "наполнять", "обозначать", "запускать", "британский", "существующий", "съесть", "опытный", "промышленный", "тратить", "навстречу", "социально", "верховный", "понадобиться", "уважать", "подводить", "жестокий", "дрожать", "крепко", "дорого", "самостоятельно", "близко", "административный", "впоследствии", "пахнуть", "слышаться", "внизу", "приступать", "тайный", "качественный", "махать", "побежать", "особенный", "расставаться", "развивать", "обретать", "избирать", "аналогичный", "замуж", "хранить", "весело", "повторяться", "самостоятельный", "надоедать", "посадить", "проигрывать", "всеобщий", "закладывать", "кто-нибудь", "исходный", "расходиться", "дешёвый", "прикрывать", "непосредственный", "подозревать", "выбрасывать", "ровно", "докладывать", "доставаться", "горный", "максимальный", "успокаивать", "отказывать", "отдыхать", "ловить", "несомненно", "вооружённый", "стандартный", "нередко", "коротко", "одинокий", "разбирать", "бормотать", "избавляться", "партийный", "отнюдь", "нервный", "помещать", "освещать", "воевать", "скромный", "украинский", "заметный", "таскать", "скорый", "двенадцать", "грубый", "велеть", "минимальный", "проявлять", "глобальный", "разнообразный", "надёжный", "действующий", "интересоваться", "окружать", "оправдывать", "сзади", "советовать", "производственный", "плюс", "осматривать", "ответственный", "пояснять", "незнакомый", "мокрый", "важнейший", "закричать", "отступать", "явный", "воспитывать", "лезть", "великолепный", "порождать", "ключевой", "доверять", "философский", "зимний", "священный", "уезжать", "независимо", "жаловаться", "вечерний", "когда-нибудь", "якобы", "нигде", "нападать", "жалко", "неплохо", "снижать", "возбуждать", "сжимать", "создаваться", "непременно", "жалеть", "христианский", "превышать", "недостаточный", "высоко", "лесной", "исполнять", "зарубежный", "почитать", "розовый", "благодарить", "сетевой", "танцевать", "искусственный", "эмоциональный", "выпадать", "исправлять", "приличный", "содержаться", "итальянский", "предъявлять", "обижаться", "рисовать", "отрицательный", "повести", "блестящий", "печальный", "волноваться", "неизвестно", "цитировать", "слева", "квадратный", "заинтересовать", "начальный", "выгодный", "реагировать", "делиться", "торопиться", "транспортный", "вначале", "вовремя", "неплохой", "свободно", "справа", "прозрачный", "настаивать", "ложиться", "вынимать", "двойной", "письменный", "применяться", "густой", "потребоваться", "инвестиционный", "польский", "небесный", "заботиться", "экологический", "молиться", "предварительный", "искренне", "передний", "наблюдаться", "оплачивать", "подходящий", "неправильный", "сопровождать", "теоретический", "краткий", "справедливый", "окончательный", "головной", "наливать", "чудесный", "металлический", "удачный", "критический", "дважды", "негативный", "во-первых", "шестой", "пожилой", "наверх", "оригинальный", "захотеться", "отставать", "почтовый", "целиком", "церковный", "сладкий", "вылетать", "невероятный", "законный", "целовать", "мгновенно", "пугать", "испугаться", "усиливать", "суровый", "обыкновенный", "ярко", "противный", "преследовать", "взаимный", "типичный", "отрывать", "немножко", "демонстрировать", "орать", "грозить", "цифровой", "благородный", "сломать", "муниципальный", "мрачный", "тесный", "тянуться", "сокращать", "виртуальный", "течь", "волновать", "серебряный", "базовый", "громкий", "класть", "гигантский", "электрический", "дурной", "избирательный", "вредный", "старинный", "глухой", "руководить", "нравственный", "аккуратно", "психический", "беспокоиться", "математический", "закрытый", "срочный", "прыгать", "вследствие", "химический", "автоматически", "технологический", "жилой", "ошибаться", "ужасно", "королевский", "рисковать", "образовательный", "рассуждать", "ежедневный", "мягко", "страховой", "твёрдо", "комментировать", "божественный", "устойчивый", "пострадать", "располагаться", "белорусский", "красиво", "логический", "совпадать", "нарисовать", "сумасшедший", "исследовать", "изображать", "поцеловать", "совершенный", "утренний", "актуальный", "всемирный", "талантливый", "энергетический", "цветной", "кидать", "выше", "уговаривать", "регулярно", "указанный", "длиться", "банковский", "волшебный", "седьмой", "производиться", "запирать", "коммунистический", "мудрый", "бледный", "нормально", "гарантировать", "хозяйственный", "благодарный", "недалеко", "модный", "игровой", "гордиться", "спасать", "железнодорожный", "книжный", "предполагаться", "водить", "радостный", "выходной", "невидимый", "сплошной", "стыдно", "здорово", "социалистический", "угрожать", "наибольший", "рыжий", "ограниченный", "бытовой", "развитый", "лечить", "напечатать", "кругом", "врать", "проговорить", "служебный", "системный", "дёшево", "улучшать", "бюджетный", "вчерашний", "ровный", "полицейский", "шутить", "уменьшать", "храниться", "двести", "уносить", "повесить", "трогать", "повышенный", "голодный", "закрываться", "отчасти", "любопытный", "подряд", "вслух", "употреблять", "соблюдать", "распространяться", "подъезжать", "размышлять", "универсальный", "ценить", "уверенно", "ложный", "привлекательный", "занятый", "торговать", "атомный", "наставать", "симпатичный", "выдающийся", "продаваться", "атаковать", "секретный", "бесполезный", "подводный", "беспокоить", "частично", "неоднократно", "догонять", "жуткий", "ничего", "районный", "приветствовать", "придерживаться", "засмеяться", "улетать", "вражеский", "таинственный", "коллективный", "биологический", "трудиться", "прекращаться", "отрезать", "грустный", "либеральный", "стучать", "бумажный", "подлежать", "рождаться", "еле", "громадный", "увеличиваться", "бессмысленный", "по-другому", "счесть", "лететь", "голосовать", "слышно", "бурный", "плотный", "фундаментальный", "автоматический", "специфический", "мыть", "повлиять", "забавный", "охранять", "обширный", "проехать", "наслаждаться", "смешно", "автомобильный", "посторонний", "нефтяной", "откровенный", "полюбить", "выделяться", "искренний", "свойственный", "строительный", "продемонстрировать", "формальный", "чуть-чуть", "испортить", "прятаться", "худой", "формироваться", "видеться", "беседовать", "объясняться", "позитивный", "зажигать", "обвинять", "действительный", "напряжённый", "командовать", "пожалеть", "театральный", "ранить", "надолго", "принципиальный", "звёздный", "кровавый", "отрицать", "восприниматься", "предлагаться", "темно", "мыслить", "горький", "контрольный", "возглавлять", "классный", "чеченский", "стеклянный", "возрастать", "заболеть", "смелый", "педагогический", "взлетать", "дорожный", "что-либо", "планироваться", "величайший", "замолчать", "одинаково", "поэтический", "правительственный", "торжественный", "ломать", "приблизительно", "недовольный", "арабский", "оптимальный", "безопасный", "драгоценный", "снизу", "делить", "могучий", "обсуждаться", "разбудить", "весенний", "ледяной", "фантастический", "седой", "студенческий", "вкусный", "полно", "шестьдесят", "пешком", "идеологический", "персональный", "раздражать", "формировать", "мучить", "испанский", "сниться", "прошедший", "решительный", "наружу", "обрадоваться", "дневной", "лунный", "где-нибудь", "временный", "слепой", "повседневный", "подвергаться", "элементарный", "анализировать", "заново", "давить", "претендовать", "языковой", "праздничный", "кредитный", "незначительный", "восьмой", "незаконный", "президентский", "снежный", "исключительный", "скучный", "немалый", "неверный", "ненужный", "передовой", "плоский", "тупой", "предстоящий", "конституционный", "худший", "драться", "альтернативный", "отвернуться", "рациональный", "латинский", "скорее", "функциональный", "поменять", "вдвоём", "внутрь", "кожаный", "целевой", "гордый", "покончить", "молодёжный", "выписывать", "прислушиваться", "стремительно", "любовный", "печатный", "непрерывный", "гениальный", "операционный", "печатать", "некогда", "фашистский", "снаружи", "земельный", "мысленно", "вытекать", "частый", "гуманитарный", "хитрый", "ежегодный", "натуральный", "сотовый", "сверкать", "награждать", "ниже", "жаркий", "периодически", "заработный", "увольнять", "магический", "подземный", "стесняться", "ругаться", "наилучший", "зафиксировать", "изнутри", "радовать", "солидный", "сырой", "трагический", "неподалёку", "чувствоваться", "светить", "плотно", "умственный", "тесно", "некуда", "светиться", "себе", "наивный", "рваться", "отчётливо", "осенний", "крестьянский", "столичный", "поесть", "телевизионный", "четверо", "годиться", "обучать", "кататься", "относительный", "слабо", "ознакомиться", "водный", "организационный", "механический", "потянуться", "грубо", "оранжевый", "всюду", "одиннадцать", "прибегать", "сознательный", "пожаловаться", "финский", "газовый", "упорно", "десятый", "направо", "беременный", "прочный", "триста", "резать", "должный", "жирный", "параллельный", "провожать", "сопротивляться", "физически", "таможенный", "гладкий", "недолго", "регулярный", "товарный", "по-разному", "условный", "закуривать", "стройный", "публиковать", "отражаться", "болтать", "одеваться", "болезненный", "регулировать", "прохожий", "отвозить", "позади", "ура", "видимый", "роскошный", "выкидывать", "скучать", "деревенский", "стабильный", "ругать", "специализированный", "женатый", "выполняться", "преступный", "стальной", "звуковой", "ограничивать", "налево", "коричневый", "годовой", "комплексный", "парламентский", "армейский", "неизменный", "абстрактный", "неудачный", "потребительский", "аналитический", "колебаться", "наверху", "ручной", "осторожный", "девятый", "обожать", "академический", "блестеть", "напрасно", "новейший", "материнский", "примитивный", "отвратительный", "поблагодарить", "влажный", "огненный", "боковой", "сгореть", "вольный", "ночевать", "вежливо", "качать", "различать", "завидовать", "устанавливаться", "напрямую", "отличать", "невысокий", "авиационный", "ласковый", "дружить", "смертельный", "жилищный", "чрезвычайный", "усталый", "долгосрочный", "защитный", "пенсионный", "сдерживать", "медный", "этнический", "уличный", "агрессивный", "писаться", "сердечный", "индийский", "украшать", "семьдесят", "территориальный", "колоссальный", "пластиковый", "непростой", "экспериментальный", "заплакать", "традиционно", "цивилизованный", "фактический", "последовательный", "путешествовать", "вдали", "молочный", "превосходить", "изящный", "трезвый", "беречь", "возить", "шагать", "толкать", "автономный", "входной", "игнорировать", "тревожный", "стимулировать", "артиллерийский", "заворачивать", "буржуазный", "прописывать", "географический", "исследовательский", "рвать", "родительский", "новогодний", "грандиозный", "условно", "обслуживать", "выучивать", "вдвое", "дружеский", "функционировать", "нисколько", "прощаться", "интенсивный", "преподавать", "вмешиваться", "необыкновенный", "романтический", "бухгалтерский", "жарко", "собачий", "съездить", "грамотный", "валютный", "уютный", "двигать", "интимный", "глупо", "нелёгкий", "избранный", "вертикальный", "дальше", "обидно", "неважный", "скачивать", "сердиться", "доехать", "шуметь", "банальный", "энергичный", "бешеный", "купаться", "восемьдесят", "влюбленный", "любоваться", "платный", "запланировать", "напугать", "добровольный", "чистить", "девяносто", "теряться", "пятьсот", "увлекаться", "варить", "гладить", "обедать", "уменьшаться", "дружно", "лить", "исламский", "поверх", "туристический", "портить", "проглатывать", "олимпийский", "извиняться", "воровать", "шумный", "кипеть", "разводиться", "пожарный", "футбольный", "жидкий", "октябрьский", "разноцветный", "сказочный", "чайный", "вправо", "проработать", "увезти", "будить", "разрешаться", "ухаживать", "начинающий", "усиливаться", "вежливый", "влево", "устный", "мусульманский", "постучать", "низко", "трижды", "жевать", "завтрашний", "приземляться", "нищий", "встречный", "вероятно", "горько", "заинтересоваться", "горячо", "хвалить", "дежурный", "прохладный", "документальный", "стирать", "запасной", "сонный", "ненадолго", "шестнадцать", "присниться", "шёлковый", "шить", "двадцатый", "промолчать", "наружный", "университетский", "тормозить", "взвешивать", "аккуратный", "целоваться", "счастливо", "стоп", "читаться", "неприятно", "террористический", "виновный", "ленивый", "восемнадцать", "африканский", "гибнуть", "раздавать", "вешать", "обучаться", "пополам", "неудобно", "алкогольный", "продлевать", "лысый", "праздновать", "различаться", "сытый", "четырнадцать", "выдыхать", "диктовать", "кухонный", "наземный", "зубной", "экономить", "вблизи", "умеренный", "несправедливый", "солёный", "голландский", "нулевой", "немедленный", "растительный", "зарегистрироваться", "часовой", "семнадцать", "азиатский", "весить", "жадный", "несовершеннолетний", "развитой", "ненормальный", "тринадцать", "рыбный", "греметь", "замужем", "плыть", "сухо", "повышаться", "убитый", "фиолетовый", "сбоку", "выпрямляться", "светло", "развязывать", "измерять", "некрасивый", "жареный", "нелегко", "лень", "сладко", "негромко", "втроём", "ужинать", "запрещаться", "уводить", "поперёк", "взрослеть", "посередине", "выздоравливать", "обменивать", "сгибать", "перекусывать", "прибивать", "одалживать", "спонтанный", "вычёркивать", "общительный", "восьмидесятый", "пересказывать", "шестьсот", "семеро", "аплодировать", "мёрзнуть", "мерить", "мочить", "пресный", "девятнадцатый", "трудолюбивый", "сушить", "загорать", "семнадцатый", "девяностый", "чудесно", "схватывать", "пятидесятый", "умываться", "девятьсот", "парковать", "вращать", "вноситься", "дырявый", "замужний", "модифицировать", "обнажать", "всеобъемлющий", "тормозной", "выползать", "транслироваться", "поутру", "поныне", "числовой", "экстремистский", "бразильский", "захлёбываться", "мимоходом", "политехнический", "портиться", "скандинавский", "сторожить", "шляться", "картофельный", "кровяной", "обниматься", "расплывчатый", "репродуктивный", "сумрачный", "временами", "заправлять", "мизерный", "переговорный", "рассекать", "спадать", "вселять", "мебельный", "мести", "обоюдный", "сценический", "движущий", "переступать", "презрительный", "шибко", "апеллировать", "насчитывать", "пыхтеть", "точить", "щекотать", "бриться", "вязкий", "заморский", "недостижимый", "отвесный", "разоблачить", "реалистичный", "самоуверенный", "тревожиться", "усматривать", "чернеть", "янтарный", "венчурный", "выучиться", "дешеветь", "империалистический", "моргать", "надавить", "непристойный", "неуклюжий", "отведать", "утомлять", "колыхаться", "насмотреться", "невесть", "обманчивый", "перебегать", "скатываться", "сотый", "сливочный", "потеть", "четырнадцатый", "программировать", "прикреплять", "передвигать", "пятнадцатый", "бодрствовать", "восемнадцатый", "сороковой", "простудиться", "тринадцатый", "шестнадцатый", "позапрошлый", "вопросительный", "многоэтажный", "дорожать", "семьсот", "страховать", "аллергический", "умножать", "восемьсот", "клеить", "гомосексуальный", "консультировать", "разменивать", "позже", "переспрашивать", "восклицательный", "гласный", "все", "меня", "будет", "мне", "было", "еще", "раз", "был", "тебя", "потому", "тебе", "прям", "них", "нас", "такое", "этом", "этого", "была", "чтото", "—", "работает", "во", "него", "понял", "всем", "всех", "думаю", "будут", "типа", "того", "были", "интересно", "знаю", "могу", "стоит", "понимаю", "которые", "хочу", "the", "выглядит", "че", "ж", "эти", "такие", "помню", "равно", "буду", "тем", "такая", "купил", "часов", "играл", "ее", "изза", "думал", "видел", "пару", "им", "както", "чтоб", "людей", "короче", "этой", "самом", "самое", "какойто", "значит", "часть", "of"}
	for _, Word.Text = range strings.Fields(Message.Text) {
		if StringInSlice(strings.ToLower(Word.Text), exclude) || Word.Text == "" {
			continue
		}
		WordResult := DB.Create(&Word)
		if WordResult.Error != nil {
			return WordResult.Error
		}
	}
	return nil
}

func GetUserFromDB(findstring string) (telebot.User, error) {
	var user telebot.User
	var err error = nil
	if string(findstring[0]) == "@" {
		user.Username = findstring[1:]
	} else {
		user.ID, err = strconv.ParseInt(findstring, 10, 64)
	}
	result := DB.Where("lower(username) = ? OR id = ?", strings.ToLower(user.Username), user.ID).First(&user)
	if result.Error != nil {
		err = result.Error
	}
	return user, err
}

type ForwardedMesssage struct {
	ChannelMessage *telebot.Message
	ChatMessage    telebot.Message
}
type ForwardMesssage struct {
	AlbumID            string
	Messages           []*telebot.Message
	Caption            string
	ForwardedMesssages []ForwardedMesssage
}

var Forward ForwardMesssage

//Repost channel post to chat
func Repost(context telebot.Context) error {
	var err error
	if context.Message().AlbumID != "" {
		Forward.Messages = append(Forward.Messages, context.Message())
		if context.Message().Caption != "" {
			Forward.Caption = context.Message().Caption
		}
		if context.Message().AlbumID != Forward.AlbumID {
			Forward.AlbumID = context.Message().AlbumID
			time.Sleep(5 * time.Second)
			sort.SliceStable(Forward.Messages, func(i, j int) bool {
				return Forward.Messages[i].ID < Forward.Messages[j].ID
			})
			var Album []telebot.Inputtable
			for i, message := range Forward.Messages {
				switch {
				case context.Message().Audio != nil:
					message.Audio.Caption = ""
					if i == 0 {
						message.Audio.Caption = Forward.Caption
					}
					Album = append(Album, message.Audio)
				case context.Message().Document != nil:
					message.Document.Caption = ""
					if i == 0 {
						message.Document.Caption = Forward.Caption
					}
					Album = append(Album, message.Document)
				case context.Message().Photo != nil:
					message.Photo.Caption = ""
					if i == 0 {
						message.Photo.Caption = Forward.Caption
					}
					Album = append(Album, message.Photo)
				case context.Message().Video != nil:
					message.Video.Caption = ""
					if i == 0 {
						message.Video.Caption = Forward.Caption
					}
					Album = append(Album, message.Video)
				}
			}
			ChatMessage, err := Bot.SendAlbum(&telebot.Chat{ID: Config.Chat}, Album)
			for i, message := range Forward.Messages {
				Forward.ForwardedMesssages = append(Forward.ForwardedMesssages, ForwardedMesssage{message, ChatMessage[i]})
			}
			Forward.AlbumID = ""
			Forward.Messages = []*telebot.Message{}
			Forward.Caption = ""
			return err
		}
		return nil
	}

	var ChatMessage *telebot.Message
	ChatMessage, err = Bot.Copy(&telebot.Chat{ID: Config.Chat}, context.Message())
	if Config.StreamChannel != 0 && strings.Contains(context.Message().Text, "zavtracast/live") {
		Bot.Copy(&telebot.Chat{ID: Config.StreamChannel}, context.Message())
	}
	Forward.ForwardedMesssages = append(Forward.ForwardedMesssages, ForwardedMesssage{context.Message(), *ChatMessage})
	return err
}

//Edit reposted post
func EditRepost(context telebot.Context) error {
	var err error
	for _, ForwardedMesssage := range Forward.ForwardedMesssages {
		if ForwardedMesssage.ChannelMessage.ID == context.Message().ID {
			if context.Media() != nil {
				_, err = Bot.Edit(&ForwardedMesssage.ChatMessage, context.Media())
			} else {
				_, err = Bot.Edit(&ForwardedMesssage.ChatMessage, GetHtmlText(*context.Message()))
			}
		}
	}
	return err
}

//Remove message
func Remove(context telebot.Context) error {
	return context.Delete()
}

func GetNope() string {
	var nope Nope
	DB.Model(Nope{}).Order("RANDOM()").First(&nope)
	return nope.Text
}

func GetHtmlText(message telebot.Message) string {
	type entity struct {
		s string
		i int
	}

	entities := message.Entities
	textString := message.Text

	if len(message.Text) == 0 {
		entities = message.CaptionEntities
		textString = message.Caption
	}

	textString = strings.ReplaceAll(textString, "<", "˂")
	textString = strings.ReplaceAll(textString, ">", "˃")
	text := utf16.Encode([]rune(textString))

	ents := make([]entity, 0, len(entities)*2)

	for _, ent := range entities {
		var a, b string

		switch ent.Type {
		case telebot.EntityBold, telebot.EntityItalic,
			telebot.EntityUnderline, telebot.EntityStrikethrough:
			a = fmt.Sprintf("<%c>", ent.Type[0])
			b = a[:1] + "/" + a[1:]
		case telebot.EntityCode, telebot.EntityCodeBlock:
			a = fmt.Sprintf("<%s>", ent.Type)
			b = a[:1] + "/" + a[1:]
		case telebot.EntityTextLink:
			a = fmt.Sprintf("<a href='%s'>", ent.URL)
			b = "</a>"
		case telebot.EntityTMention:
			a = fmt.Sprintf("<a href='tg://user?id=%d'>", ent.User.ID)
			b = "</a>"
		default:
			continue
		}

		ents = append(ents, entity{a, ent.Offset})
		ents = append(ents, entity{b, ent.Offset + ent.Length})
	}

	// reverse entities
	for i, j := 0, len(ents)-1; i < j; i, j = i+1, j-1 {
		ents[i], ents[j] = ents[j], ents[i]
	}

	for _, ent := range ents {
		r := utf16.Encode([]rune(ent.s))
		text = append(text[:ent.i], append(r, text[ent.i:]...)...)
	}

	textString = string(utf16.Decode(text))

	if len(message.Entities) != 0 && message.Entities[0].Type == telebot.EntityCommand {
		if textString[1:4] == "set" {
			textString = strings.Join(strings.Split(textString, " ")[2:], " ")
		} else {
			textString = textString[message.Entities[0].Length+1:]
		}
	}

	return textString
}
